# ---------------trying-----------------
# 时间2021/8/15 20:07
print('''----------------------------------请按提示操作----------------------------------
''')
c='y'
d=''
print('''操作序号

    1.加法

    2.减法

    3.乘法

    4.除法

    5.幂运算

    6.开n次根号

    7.整除

    8.取余

    9.比大小''')
print('')
while c == 'y' :
# 序号输入模块----------------------------------------------------------------------------------
    num = '99'
    e = 0
    while e == 0:
        for item in range(0, 11):
            if num == str(item) and num != '10':
                e = 1
                break
            if item == 10:
                print('对不起，输入无效，可以输入从1到9的序号')
                d=''
                print('')
            if item >= 1:
                continue
                # 操作序号显示模块------------------------------------------------------------
            if d == 'r':
                d = input('如需要查看操作序号，输入y并按下回车,跳过请直接按下回车')
                print('')
            while d != 'y' and d != '':
                print('报错！仅可输入y或直接按下回车')
                print('')
                d = input('请重新输入:')
                print('')
            if d == 'y':
                print('''操作序号

    1.加法

    2.减法

    3.乘法

    4.除法

    5.幂运算

    6.开n次根号

    7.整除

    8.取余

    9.比大小''')
                print('')
                # -------------------------------------------------------------操作序号显示模块
            num = input('请输入操作序号:')
            print('')
# ----------------------------------------------------------------------------------#序号输入模块
#客体功能区-------------------------------------------------------------------------------------
    if num == '1':#加法模块
        print('------------------------------目前仅可输入整数----------------------------------')
        print('')
        a = int(input('请输入一个加数的值，然后按下回车键'))
        print('')
        b = int(input('请输入另一个加数的值，然后按下回车键'))
        print('')
        print('结果为', a + b)
        print('')
        print('--------------------------------------------------------------------------------')
    elif num == '2':#减法模块
        print('------------------------------目前仅可输入整数----------------------------------')
        print('')
        a = int(input('请输入被减数的值，然后按下回车键'))
        print('')
        b = int(input('请输入减数的值，然后按下回车键'))
        print('')
        print('结果为', a - b)
        print('')
        print('--------------------------------------------------------------------------------')
    elif num == '4':#除法模块
        print('------------------------------目前仅可输入整数----------------------------------')
        print('')
        a = int(input('请输入被除数的值，然后按下回车键'))
        print('')
        b = int(input('请输入除数的值，然后按下回车键'))
        print('')
        print(('报错！除数不能为0') if b == 0 else ('结果为' + str(a / b)))
        print('')
        print('--------------------------------------------------------------------------------')
    elif num == '3':#乘法模块
        print('------------------------------目前仅可输入整数----------------------------------')
        print('')
        a = int(input('请输入一个乘数的值，然后按下回车键'))
        print('')
        b = int(input('请输入另一个乘数的值，然后按下回车键'))
        print('')
        print('结果为', a * b)
        print('')
        print('--------------------------------------------------------------------------------')
    elif num == '5':#幂运算模块
        print('------------------------------目前仅可输入整数----------------------------------')
        print('')
        a = int(input('请输入底数的值，然后按下回车键'))
        print('')
        b = int(input('请输入指数的值，然后按下回车键'))
        r = range(-9999, 10000)
        if a in r and b in r:
            print('')
            print(('报错！底数和指数不能同时为0') if a == 0 and b == 0 else ('结果为' + str(a ** b)))
            print('')
            print('--------------------------------------------------------------------------------')
        else:
            print('')
            print('对不起，仅支持底数和指数的绝对值均小于10000的幂运算')
            print('')
    elif num == '6':#开根号模块
        print('------------------------------目前仅可输入整数----------------------------------')
        print('')
        a = int(input('请输入根号下数的值，然后按下回车键'))
        print('')
        b = int(input('请输入n的值，然后按下回车键'))
        print('')
        print('报错！n值不能为0' if b == 0 else ('结果为' + str(a ** (1 / b))))
        print('')
        print('--------------------------------------------------------------------------------')
    elif num == '7':#整除模块
        print('------------------------------目前仅可输入整数----------------------------------')
        print('')
        a = int(input('请输入被除数的值，然后按下回车键'))
        print('')
        b = int(input('请输入除数的值，然后按下回车键'))
        print('')
        print(('报错！除数不能为0') if b == 0 else ('结果为' + str(a // b)))
        print('')
        print('--------------------------------------------------------------------------------')
    elif num == '8':#取余模块
        print('------------------------------目前仅可输入整数----------------------------------')
        print('')
        a = int(input('请输入被除数的值，然后按下回车键'))
        print('')
        b = int(input('请输入除数的值，然后按下回车键'))
        print('')
        print(('报错！除数不能为0') if b == 0 else ('结果为' + str(a % b)))
        print('')
        print('--------------------------------------------------------------------------------')
    elif num == '9':#比较模块
        print('------------------------------目前仅可输入整数----------------------------------')
        print('')
        a = int(input('请输入第一个数的值，然后按下回车键'))
        print('')
        b = int(input('请输入第二个数的值，然后按下回车键'))
        print('')
        if a > b:
            print(a, '大于', b)
        elif a == b:
            print(a, '等于', b)
        elif a < b:
            print(a, '小于', b)
        print('')
        print('--------------------------------------------------------------------------------')
#-------------------------------------------------------------------------------------客体功能区
    d='r'
    c=input('输入y，并按下回车进行下一次运算；直接按下回车退出计算器')
    print('')
    while c!='y' and c!='':
        print('')
        print('报错！仅可输入y或直接按下回车')
        print('')
        c=input('请重新输入:')
        print('')
    print('--------------------------------------------------------------------------------')