# ---------------trying-----------------
# 时间2021/8/29 1:25
#误触保护模块--------------------------------------------------------------------------------
x=input('是否确认进行更新日志操作？是请输入yes并按下空格,否则直接按下空格')
print('')
while x!='' and x!='yes':
    print('输入错误，是请输入yes并按下空格,否则直接按下空格')
    print('')
    x=input('请重新输入')
    print('')
if x=='yes':
    for item in range(3):
        pwd = input('请输入密码')
        print('')
        if pwd == '7452kk':
            print('密码正确')
            print('')
            break
        else:
            print('密码不正确')
            print('')
    else:  # 循环正常结束才会执行，而不是被 break 打断结束
        print('对不起，，三次密码均使用错误')
        print('')
print('--------------------------------------------------------------------------------')
#------------------------------------------------------------------------------#误触保护模块